// cppl-homeworks_10_03.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
template <class T>
class smart_ptr {
    T* ptr;
    //отключаем оператор присваивания и конструктор копирования
    smart_ptr<T>& operator=(const smart_ptr<T>& other) = delete;
    smart_ptr(const smart_ptr<T>& other) = delete;
public:
    //перегрузка оператора разименовывания
    T& operator*() const {
        return *ptr;
    }
    //конструктор
    smart_ptr(T a) {
        ptr = new T;
        *ptr = a;
    }
    //метод релиз, возвращает сыырой указатель и освобождает владение
    auto release() {
        auto released = ptr;
        ptr = nullptr;
        return released;
    }
   /* auto print() {
        std::cout << *ptr << std::endl;
    }*/
    ~smart_ptr() {
        delete ptr;
        std::cout << "destructed" << std::endl;
    }
};

int main()
{
    smart_ptr<int> T(6);
    //T.print();
    //*T = *T + 5;
    //T.print();

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
